In [47]:
import pandas as pd
import numpy as py

In [48]:
df1 = pd.read_csv('mark.csv')
df2 = pd.read_csv('student.csv')

In [49]:
df1.head()

   Student_id  Mark     City
0           1    95  Chennai
1           2    70    Delhi
2           3    98   Mumbai
3           4    75     Pune
4           5    89    Kochi

In [50]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 232 entries, 0 to 231
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Student_id  232 non-null    int64
 1   Mark        232 non-null    int64
 2   City        232 non-null    object
dtypes: int64(2), object(1)
memory usage: 5.6+ KB

In [51]:
df2.head()

   Student_id  Age  Gender      Grade Employed
0           1   19    Male  1st Class      yes
1           2   20  Female  2nd Class       no
2           3   18    Male  1st Class       no
3           4   21  Female  2nd Class       no
4           5   19    Male  1st Class       no

In [52]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 232 entries, 0 to 231
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Student_id  232 non-null    int64
 1   Age         232 non-null    int64
 2   Gender      232 non-null    object
 3   Grade       232 non-null    object
 4   Employed    232 non-null    object
dtypes: int64(2), object(3)
memory usage: 9.2+ KB

In [53]:
# The two data will be merged together
combined_df = pd.merge(df1,df2)

In [54]:
# The new data display afther the merged
combined_df.head()

   Student_id  Mark     City  Age  Gender      Grade Employed
0           1    95  Chennai   19    Male  1st Class      yes
1           2    70    Delhi   20  Female  2nd Class       no
2           3    98   Mumbai   18    Male  1st Class       no
3           4    75     Pune   21  Female  2nd Class       no
4           5    89    Kochi   19    Male  1st Class       no

In [55]:
#the combined_df is the combined data that will now be transformed, the display shows that the count is giving the same data
combined_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 232 entries, 0 to 231
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Student_id  232 non-null    int64
 1   Mark        232 non-null    int64
 2   City        232 non-null    object
 3   Age         232 non-null    int64
 4   Gender      232 non-null    object
 5   Grade       232 non-null    object
 6   Employed    232 non-null    object
dtypes: int64(3), object(4)
memory usage: 12.8+ KB

In [56]:
#checking for any null or blank rows within the dataset, this is to sum the number of blank or null rows
combined_df.isnull().sum()

Student_id    0
Mark          0
City          0
Age           0
Gender        0
Grade         0
Employed      0
dtype: int64

In [57]:
#this display shows the statistical interpretation of the data
combined_df.describe()

       Student_id        Mark         Age
count  232.000000  232.000000  232.000000
mean   116.500000   71.400862   19.896552
std     67.116814   17.116069    1.030944
min      1.000000   40.000000   18.000000
25%     58.750000   55.000000   19.000000
50%    116.500000   75.000000   20.000000
75%    174.250000   85.250000   21.000000
max    232.000000  100.000000   22.000000

In [58]:
#the count of yes and no response under the employed column
combined_df["Employed"].value_counts()

Employed
no     133
yes     99
Name: count, dtype: int64

In [59]:
#the count of grades response under the grade column, this will display total number of students with grades
combined_df["Grade"].value_counts()

Grade
2nd Class    80
3rd Class    80
1st Class    72
Name: count, dtype: int64

In [60]:
# Convert 'yes' to 1, other values to 0
combined_df['Employed'] = combined_df['Employed'].apply(lambda x: 1 if x == 'yes' else 0)

In [61]:
combined_df.describe()

       Student_id        Mark         Age    Employed
count  232.000000  232.000000  232.000000  232.000000
mean   116.500000   71.400862   19.896552    0.426724
std     67.116814   17.116069    1.030944    0.495671
min      1.000000   40.000000   18.000000    0.000000
25%     58.750000   55.000000   19.000000    0.000000
50%    116.500000   75.000000   20.000000    0.000000
75%    174.250000   85.250000   21.000000    1.000000
max    232.000000  100.000000   22.000000    1.000000

In [62]:
# Define a mapping dictionary
grade_mapping = {'1st Class': 3, '2nd Class': 2, '3rd Class': 1}

In [63]:
# Apply the mapping to the Grade column, then create another column for numeric grade
combined_df['Numeric Grade'] = combined_df['Grade'].map(grade_mapping)

In [64]:
combined_df.head()

   Student_id  Mark     City  Age  Gender      Grade  Employed  Numeric Grade
0           1    95  Chennai   19    Male  1st Class         1              3
1           2    70    Delhi   20  Female  2nd Class         0              2
2           3    98   Mumbai   18    Male  1st Class         0              3
3           4    75     Pune   21  Female  2nd Class         0              2
4           5    89    Kochi   19    Male  1st Class         0              3

In [65]:
combined_df.describe()

       Student_id        Mark         Age    Employed  Numeric Grade
count  232.000000  232.000000  232.000000  232.000000     232.000000
mean   116.500000   71.400862   19.896552    0.426724       1.965517
std     67.116814   17.116069    1.030944    0.495671       0.810441
min      1.000000   40.000000   18.000000    0.000000       1.000000
25%     58.750000   55.000000   19.000000    0.000000       1.000000
50%    116.500000   75.000000   20.000000    0.000000       2.000000
75%    174.250000   85.250000   21.000000    1.000000       3.000000
max    232.000000  100.000000   22.000000    1.000000       3.000000

In [66]:
combined_df["Numeric Grade"].value_counts()

Numeric Grade
2    80
1    80
3    72
Name: count, dtype: int64